{
    "categoria1": {
      "nombre": "Accesorios para Smartphones",
      "productos": [
        {
          "nombre": "Cargador inalámbrico rápido",
          "precio": 29.99,
          "caracteristicas": "Carga rápida de 15W, compatible con iPhone y Android, diseño delgado y portátil.",
          "foto": "Imagen de un cargador negro sobre un escritorio moderno."
        },
        {
          "nombre": "Funda protectora para iPhone 14",
          "precio": 19.99,
          "caracteristicas": "Resistente a golpes, diseño transparente, bordes elevados para protección de pantalla y cámara.",
          "foto": "Funda transparente en un iPhone con fondo minimalista."
        },
        {
          "nombre": "Auriculares Bluetooth con cancelación de ruido",
          "precio": 49.99,
          "caracteristicas": "Bluetooth 5.0, cancelación activa de ruido, duración de batería de 20 horas, micrófono integrado.",
          "foto": "Auriculares negros sobre una mesa junto a un smartphone."
        },
        {
          "nombre": "Power Bank 20,000mAh",
          "precio": 34.99,
          "caracteristicas": "Carga rápida QC3.0, dos puertos USB, capacidad para cargar hasta 4 veces un smartphone.",
          "foto": "Power Bank blanco sobre una superficie de madera."
        },
        {
          "nombre": "Soporte magnético para coche",
          "precio": 15.99,
          "caracteristicas": "Imanes fuertes, rotación 360 grados, fácil instalación en rejilla de ventilación.",
          "foto": "Soporte montado en un coche con un smartphone en uso."
        },
        {
          "nombre": "Cargador de coche doble USB",
          "precio": 12.99,
          "caracteristicas": "Carga rápida de hasta 2 dispositivos, diseño compacto, compatible con todos los smartphones.",
          "foto": "Cargador en la toma de un coche con dos cables conectados."
        },
        {
          "nombre": "Cable de carga trenzado USB-C",
          "precio": 9.99,
          "caracteristicas": "Cable trenzado resistente de 1.5m, compatible con carga rápida, conector USB-C.",
          "foto": "Primer plano del cable trenzado en gris oscuro."
        },
        {
          "nombre": "Anillo de soporte para teléfono",
          "precio": 7.99,
          "caracteristicas": "Rotación 360 grados, soporte y agarre adicional, diseño ultradelgado.",
          "foto": "Anillo colocado en la parte trasera de un smartphone."
        },
        {
          "nombre": "Adaptador de auriculares USB-C a 3.5mm",
          "precio": 12.99,
          "caracteristicas": "Compatible con dispositivos sin jack de auriculares, sonido de alta fidelidad, diseño compacto.",
          "foto": "Adaptador conectado a un smartphone."
        },
        {
          "nombre": "Protector de pantalla de vidrio templado para iPhone 14",
          "precio": 14.99,
          "caracteristicas": "Resistencia a rayones, fácil instalación, borde redondeado para protección completa.",
          "foto": "Protector de pantalla sobre un iPhone en primer plano."
        },
        {
          "nombre": "Lente gran angular para cámara de smartphone",
          "precio": 24.99,
          "caracteristicas": "Lente desmontable de 0.45x gran angular, ideal para paisajes y fotos de grupo.",
          "foto": "Lente acoplada a la cámara de un smartphone en uso."
        }
      ]
    },
    "categoria2": {
      "nombre": "Smart Home",
      "productos": [
        {
          "nombre": "Bombilla inteligente WiFi",
          "precio": 24.99,
          "caracteristicas": "Control por app, compatible con Alexa y Google Home, regulación de intensidad y colores.",
          "foto": "Bombilla encendida cambiando de color en un ambiente moderno."
        },
        {
          "nombre": "Enchufe inteligente",
          "precio": 19.99,
          "caracteristicas": "Control remoto vía app, programación de horarios, compatible con Alexa y Google Home.",
          "foto": "Enchufe conectado a una lámpara en un entorno doméstico."
        },
        {
          "nombre": "Cámara de seguridad inteligente 1080p",
          "precio": 59.99,
          "caracteristicas": "Visión nocturna, audio bidireccional, detección de movimiento, grabación en la nube.",
          "foto": "Cámara montada en la esquina de una habitación con vista al exterior."
        },
        {
          "nombre": "Termostato inteligente WiFi",
          "precio": 129.99,
          "caracteristicas": "Control por app, programación automática de temperatura, compatible con sistemas HVAC.",
          "foto": "Termostato montado en una pared moderna."
        },
        {
          "nombre": "Timbre inteligente con cámara",
          "precio": 89.99,
          "caracteristicas": "Cámara HD, detección de movimiento, audio bidireccional, compatible con Alexa.",
          "foto": "Timbre montado en la entrada de una casa moderna."
        },
        {
          "nombre": "Sensor de puerta inteligente",
          "precio": 29.99,
          "caracteristicas": "Detección de apertura/cierre, alertas en tiempo real, compatible con smart home.",
          "foto": "Sensor instalado en la puerta de entrada."
        },
        {
          "nombre": "Control remoto universal WiFi",
          "precio": 39.99,
          "caracteristicas": "Controla todos los dispositivos con infrarrojos, compatible con Alexa y Google Home, app fácil de usar.",
          "foto": "Control remoto compacto en una sala de estar."
        },
        {
          "nombre": "Altavoz inteligente con asistente virtual",
          "precio": 49.99,
          "caracteristicas": "Control por voz, integración con dispositivos smart home, reproducción de música.",
          "foto": "Altavoz inteligente en una mesa de centro."
        },
        {
          "nombre": "Persianas automáticas inteligentes",
          "precio": 199.99,
          "caracteristicas": "Control por app, programación de apertura/cierre, compatible con Alexa.",
          "foto": "Persianas en un entorno moderno con luz natural."
        },
        {
          "nombre": "Sensor de temperatura y humedad WiFi",
          "precio": 34.99,
          "caracteristicas": "Monitorización en tiempo real, alertas de cambios, compatible con otros dispositivos smart.",
          "foto": "Sensor montado en una pared junto a una planta."
        },
        {
          "nombre": "Interruptor de luz inteligente WiFi",
          "precio": 39.99,
          "caracteristicas": "Control táctil o por app, compatible con Alexa y Google Home, programación de horarios.",
          "foto": "Interruptor inteligente en una pared blanca."
        }
      ]
    },
    "categoria3": {
      "nombre": "Wearables",
      "productos": [
        {
          "nombre": "Reloj inteligente con monitor de salud",
          "precio": 79.99,
          "caracteristicas": "Pantalla AMOLED, monitor de frecuencia cardíaca, seguimiento de sueño y actividad física, resistente al agua.",
          "foto": "Primer plano del reloj en una muñeca mostrando datos de salud."
        },
        {
          "nombre": "Pulsera de actividad con GPS",
          "precio": 59.99,
          "caracteristicas": "Medición de pasos, calorías, ritmo cardíaco, GPS integrado para seguimiento de rutas.",
          "foto": "Pulsera de actividad en uso durante una carrera."
        },
        {
          "nombre": "Auriculares deportivos con resistencia al agua",
          "precio": 39.99,
          "caracteristicas": "Bluetooth 5.0, diseño ergonómico, resistencia IPX7 al sudor y agua, 10 horas de autonomía.",
          "foto": "Auriculares deportivos en una sesión de entrenamiento."
        },
        {
          "nombre": "Smartwatch para niños con GPS",
          "precio": 49.99,
          "caracteristicas": "Rastreo GPS en tiempo real, llamadas de emergencia, resistente a golpes y agua.",
          "foto": "Niño usando el smartwatch mientras juega."
        },
        {
          "nombre": "Reloj inteligente con monitor de presión arterial",
          "precio": 69.99,
          "caracteristicas": "Monitoreo de presión arterial y frecuencia cardíaca, alertas de salud, resistente al agua.",
          "foto": "Reloj mostrando datos de presión arterial en la pantalla."
        },
        {
          "nombre": "Gafas inteligentes con audio integrado",
          "precio": 129.99,
          "caracteristicas": "Reproducción de música a través de las patillas, llamadas manos libres, diseño resistente a la intemperie.",
          "foto": "Persona usando las gafas inteligentes mientras camina por la ciudad."
        },
        {
          "nombre": "Smartwatch con monitor de oxígeno en sangre",
          "precio": 99.99,
          "caracteristicas": "Monitorización de oxígeno en sangre (SpO2), frecuencia cardíaca, alertas de salud, resistente al agua.",
          "foto": "Primer plano del reloj mostrando niveles de oxígeno."
        },
        {
          "nombre": "Auriculares de conducción ósea",
          "precio": 79.99,
          "caracteristicas": "Diseño abierto, sin bloquear los oídos, ideal para deportes al aire libre, resistencia al agua.",
          "foto": "Persona corriendo con los auriculares puestos."
        },
        {
          "nombre": "Reloj fitness con medidor de estrés",
          "precio": 89.99,
          "caracteristicas": "Medición de nivel de estrés, seguimiento del sueño, alerta de relajación.",
          "foto": "Reloj mostrando los niveles de estrés en una muñeca."
        },
        {
          "nombre": "Pulsera inteligente para control del sueño",
          "precio": 49.99,
          "caracteristicas": "Seguimiento avanzado del sueño, análisis de fases REM, alertas de bienestar.",
          "foto": "Pulsera en una mesita de noche junto a una lámpara."
        },
        {
          "nombre": "Auriculares inalámbricos con IA",
          "precio": 149.99,
          "caracteristicas": "Cancelación de ruido inteligente con inteligencia artificial, ajuste automático según el entorno, resistencia al agua.",
          "foto": "Auriculares cargando en su estuche."
        }
      ]
    },
    "categoria4": {
    "nombre": "Gaming",
    "productos": [
      {
        "nombre": "Teclado mecánico retroiluminado RGB",
        "precio": 89.99,
        "caracteristicas": "Switches mecánicos, retroiluminación RGB personalizable, 104 teclas anti-ghosting.",
        "foto": "Teclado iluminado con colores RGB en un entorno gaming."
      },
      {
        "nombre": "Ratón inalámbrico para gaming 16000 DPI",
        "precio": 59.99,
        "caracteristicas": "DPI ajustable hasta 16000, 7 botones programables, diseño ergonómico.",
        "foto": "Ratón negro con luces LED en un escritorio gaming."
      },
      {
        "nombre": "Silla gamer ergonómica con soporte lumbar",
        "precio": 199.99,
        "caracteristicas": "Reclinable hasta 180 grados, soporte lumbar y para cuello, reposabrazos ajustables.",
        "foto": "Silla negra y roja en una habitación gamer."
      },
      {
        "nombre": "Monitor gaming curvo 144Hz",
        "precio": 299.99,
        "caracteristicas": "Resolución 2560x1440, tasa de refresco de 144Hz, tiempo de respuesta de 1ms.",
        "foto": "Monitor curvo en un escritorio con equipo gaming."
      },
      {
        "nombre": "Auriculares gaming con micrófono retráctil",
        "precio": 79.99,
        "caracteristicas": "Sonido envolvente 7.1, micrófono con cancelación de ruido, almohadillas de espuma con memoria.",
        "foto": "Auriculares negros con luces LED junto a un teclado gaming."
      },
      {
        "nombre": "Alfombrilla para ratón XXL",
        "precio": 19.99,
        "caracteristicas": "Superficie de control de precisión, base antideslizante, tamaño extra grande para teclado y ratón.",
        "foto": "Alfombrilla negra ocupando todo el escritorio."
      },
      {
        "nombre": "Tarjeta gráfica Nvidia RTX 4070",
        "precio": 699.99,
        "caracteristicas": "8GB GDDR6, ray tracing en tiempo real, soporte para 4K gaming.",
        "foto": "Tarjeta gráfica con diseño moderno y luces LED."
      },
      {
        "nombre": "Controlador de mando inalámbrico para PC/Consola",
        "precio": 49.99,
        "caracteristicas": "Conexión inalámbrica, vibración dual, botones personalizables.",
        "foto": "Mando negro con detalles en azul sobre un escritorio gamer."
      },
      {
        "nombre": "Base de carga dual para mandos de consola",
        "precio": 24.99,
        "caracteristicas": "Carga simultánea de dos mandos, indicadores LED de carga, diseño compacto.",
        "foto": "Base de carga con dos mandos apoyados en ella."
      },
      {
        "nombre": "Tarjeta de sonido externa USB para gaming",
        "precio": 39.99,
        "caracteristicas": "Sonido envolvente 7.1, conectividad USB, compatible con auriculares y micrófono gaming.",
        "foto": "Tarjeta de sonido junto a un ordenador gamer."
      },
      {
        "nombre": "Micrófono de estudio USB para streaming",
        "precio": 99.99,
        "caracteristicas": "Grabación en alta definición, patrón polar cardioide, soporte antivibración incluido.",
        "foto": "Micrófono montado en un brazo sobre un escritorio."
      }
    ]
  },
  "categoria5": {
    "nombre": "Fitness y Bienestar",
    "productos": [
      {
        "nombre": "Colchoneta de yoga antideslizante",
        "precio": 29.99,
        "caracteristicas": "Material antideslizante de 6mm, resistente al sudor, fácil de enrollar y transportar.",
        "foto": "Colchoneta verde sobre un suelo de madera."
      },
      {
        "nombre": "Banda elástica de resistencia",
        "precio": 14.99,
        "caracteristicas": "5 niveles de resistencia, ideal para ejercicios de fuerza y estiramiento, material duradero.",
        "foto": "Bandas elásticas de colores sobre un banco de gimnasio."
      },
      {
        "nombre": "Rueda abdominal con rodamiento doble",
        "precio": 19.99,
        "caracteristicas": "Rodamiento suave, asas acolchadas, incluye alfombrilla para rodillas.",
        "foto": "Rueda abdominal sobre un suelo de gimnasio."
      },
      {
        "nombre": "Mancuernas ajustables 5-25kg",
        "precio": 199.99,
        "caracteristicas": "Sistema de ajuste rápido de peso, agarre antideslizante, ideal para entrenamientos en casa.",
        "foto": "Mancuernas ajustables en un soporte en una habitación fitness."
      },
      {
        "nombre": "Reloj inteligente deportivo con GPS",
        "precio": 99.99,
        "caracteristicas": "Monitoreo de actividad, frecuencia cardíaca y rutas, resistente al agua hasta 50 metros.",
        "foto": "Primer plano del reloj en una muñeca durante una carrera."
      },
      {
        "nombre": "Cuerda para saltar con contador de calorías",
        "precio": 24.99,
        "caracteristicas": "Mango ergonómico, contador digital de saltos y calorías, longitud ajustable.",
        "foto": "Cuerda para saltar en una habitación de entrenamiento."
      },
      {
        "nombre": "Botella de agua inteligente con recordatorio de hidratación",
        "precio": 39.99,
        "caracteristicas": "Alerta para beber agua, capacidad de 600ml, tapa de cierre automático.",
        "foto": "Botella en una mesa junto a una esterilla de yoga."
      },
      {
        "nombre": "Pesas de tobillo ajustables",
        "precio": 19.99,
        "caracteristicas": "Peso ajustable hasta 2kg por pieza, cierre de velcro resistente, ideales para caminatas y entrenamientos.",
        "foto": "Pesas de tobillo en una persona realizando ejercicios."
      },
      {
        "nombre": "Monitor de composición corporal Bluetooth",
        "precio": 49.99,
        "caracteristicas": "Análisis de peso, grasa corporal, músculo y agua, app para seguimiento en smartphone.",
        "foto": "Monitor de composición corporal en un baño moderno."
      },
      {
        "nombre": "Bicicleta estática plegable",
        "precio": 149.99,
        "caracteristicas": "Resistencia ajustable, monitor de ritmo cardíaco, diseño plegable para ahorrar espacio.",
        "foto": "Bicicleta estática en una habitación moderna."
      },
      {
        "nombre": "Rodillo de espuma para masajes",
        "precio": 29.99,
        "caracteristicas": "Textura de relieve para masajes profundos, material EVA duradero, ideal para recuperación muscular.",
        "foto": "Rodillo de espuma sobre una alfombra de entrenamiento."
      }
    ]
  }
}
  